// 1. Өгөгдсөн 2 тооны ихийг олох функц бич.
// 2. Өгөгдсөн array -аас өгөгдсөн тоо байгаа эсэхийг олох функц бич. 
    // Тухайн тоо байвал индексийг буцаана. Байхгүй бол -1 буцаана.
// 3. Өгөгдсөн тэмдэгт мөрөөс -аас өгөгдсөн тэмдэгт байгаа эсэхийг олох функц бич. 
    // Тухайн тэмдэгт байвал индексийг буцаана. Байхгүй бол -1 буцаана.
// 4. Өгөгдсөн 2 тоон интервал дахь санамсаргүй тоо буцаах функц бич.
// 5. Өгөгдсөн array - ийн дундажыг олох функц бич.
// 6. Өгөгдсөн array - ийн нийлбэрийг олох функц бич.
// 7. Өгөгдсөн тоо анхны эсэхийг олох функц бич.
// 8. Өгөгдсөн тэмдэгт мөрийн бүх үсгийг том үсэг болгох функц бич.
// 9. Өгөгдсөн тэмдэгт мөрийн бүх үсгийг жижиг үсэг болгох функц бич.


//1 Өгөгдсөн 2 тооны ихийг олох функц бич.

let x = 100;
let y = 35;

function myFunc(a,b){
    if(a<b){
        console.log("ih toon" , b);
    }else if(a>b){
        console.log("ih toon" , a);
    }else{
        console.log("hoyr too tentsuu");
    }
}
myFunc(x,y);



//2 Өгөгдсөн array -аас өгөгдсөн тоо байгаа эсэхийг олох функц бич. 
    // Тухайн тоо байвал индексийг буцаана. Байхгүй бол -1 буцаана.

let medq = [10,20,30,40,50];



let s = prompt ("Ta duriin too oruulna uu");

function myFunction (a,b) {
    if ()
}
    




//3 Өгөгдсөн тэмдэгт мөрөөс -аас өгөгдсөн тэмдэгт байгаа эсэхийг олох функц бич. 
    // Тухайн тэмдэгт байвал индексийг буцаана. Байхгүй бол -1 буцаана.







//4 Өгөгдсөн 2 тоон интервал дахь санамсаргүй тоо буцаах функц бич.






//5 Өгөгдсөн array - ийн дундажыг олох функц бич.

let arrays = [10,20,30,40,50];

let average = [];


let sum = function (a, b, c, d, e) {
    return sum = (a + b + c + d + e)
}
console.log(sum(10,20,30,40,50));

// console.log(sum/av);






//6
//7
//8
//9

